{"Mississippi": "<ul><li>The Department of Public Safety maintains an automated listing of concealed carry license holders and such information shall be available upon request to all law enforcement agencies through the Mississippi Crime Information Center. Records relating to licensees/applications for licenses for concealed carry are private for 45 days from the date the license is issued or the final denial of an application, then publicly available.</li></ul>", "Oklahoma": "<ul><li>The identifying information of those who have been issued permits is available only to law enforcement.  The Bureau of Investigation publishes a report on gun permits.</li></ul>", "Wyoming": "<ul><li>Wyoming does not have a firearm registery outside of the records that sellers are required to keep, and those are not made public.</li></ul>", "Minnesota": "<ul><li>No state permit is required to possess a rifle, shotgun, or handgun. All data pertaining to the purchase or transfer of firearms and applications for permits to carry firearms which are collected by state agencies, political subdivisions or statewide systems are classified as private. M.S.A. 1387(c)2.</li></ul>", "Illinois": "<ul><li>State police keep records of Firearm Owner's Identification card holders, but cannot release this information to the public. The police can release statistical information, but no identifying information.<ul><li>In early 2011, Illinois Attorney General’s office ruled that the names of FOID card holders are public under Illinois open records laws in response to a request from the Associated Press.</li><li>Illinois State Rifle Association filed a lawsuit against the AP and the Illinois State Police. In March 2011, The ISRA was granted a temporary restraining order against the release of identifying information related to FOID card holders by 10th district judge Scott Shore.</li><li>Legislation ensued that ammended FOIA in the state preventing information from being made public.</li></ul></li><li>Anyone who transfers a firearm must keep a record of the transaction for at least 10 years, which must be made available to law enforcement officials.</li></ul>", "State": "<ul><li>Details</li></ul>", "Georgia": "<ul><li>Georgia has not passed any legislation either permitting or prohibiting records related to gun ownership or licenses. However, firearms dealers must keep track of sales, keep those records on premises and make those records available to law enforcement officials.</li></ul>", "Arkansas": "<ul><li>Concealed carry permits are issued by the state police, and only law enforcement has access to the records. No permit is required to own a firearm, though there are restrictions on who can legally own one.</li></ul>", "New Mexico": "<ul><li>New Mexico does not require a permit to own or purchase firearms except in the case of concealed carry handguns. Information relating to an applicant or to a licensee is confidential and exempt from public disclosure. However, this information is available to a state or local law enforcement agency upon request.</li></ul>", "Ohio": "<ul><li>The Ohio peace officer training commission shall maintain statistics with respect to the issuance, renewal, suspension, revocation, and denial of licenses. Nothing in the statistics or the statistical report shall identify, or enable the identification of, any individual who was issued or denied a license, for whom a license was renewed, whose license was suspended or revoked, or for whom application processing was suspended. The statistics and the statistical report are public records.</li><li>In Cleveland: Handgun registration, dealer, and license records, including name and address, as well as serial numbers for the handgun, are maintained by the Chief of Police, but are not public record.</li></ul>", "Indiana": "<ul><li>General information about gun licenses can be released to journalists or academic researchers as long as the personal information that may disclose the identitity of a gun license holder has been removed.</li><li>In South Bend, minors found in possession of a firearm must produce a letter to their school principal which is then given to the Common Council's Health and Public Safety Committee. The names of minors are kept confidential.</li></ul>", "Maryland": "<ul><li>The state police keeps records of all permit applications, however none of the information is public record.</li><li>The department of State Police must compile and maintain a handgun roster of authorized handguns and annually publish the handgun roster in the Maryland Register.</li></ul>", "Louisiana": "<ul><li>Any information in or related to an application to carry a concealed handgun is confidential and is not public record. Yet, all firearms are to be registered with the Department of Public Safety with firearm number or identifier, the name, address and place of business or employment of the person in possession of the firearm and  the place where the firearm is usually kept.</li></ul>", "Idaho": "<ul><li>Information on those with a license (or those who apply) to carry a concealed weapon is confidential.</li></ul>", "Arizona": "<ul><li>A political subdivision cannot keep a list or database of:<ul><li>Information identifying a person who stores a weapon in temporary storage at a public building or event. The person who takes the weapon into storage may ask for a government issued ID and keep the ID with the weapon, but must return the ID with the weapon and not make any copies or records of the ID.</li><li>Any identifying information about a person who buys, sells or transfers a firearm, unless the transaction includes a federally licensed firearms dealer or if the information is collected for law enforcement purposes.</li><li>Information including the description or serial number of a weapon temporarily stored at a public event or establishment.</li></ul></li></ul>", "Iowa": "<ul><li>Iowa requires a permit to be able to purchase a firearm, which is obtained through the county sheriff's office. The public is allowed to view the permits, though access to full lists of the permit holders in a geographic area may vary by county.</li><li>The Commissioner of Public Safety keeps records of concealed carry permits, but the law is unclear on whether they are made public.</li></ul>", "New York": "<ul><li>The name and address of any person to whom \nan application for any license has been granted \nshall be a public record.</li><li>New legislation will potentially limit the amount of information available about people who have gun licenses by allowing people to exempt their names from a new database being created.</li></ul>", "Michigan": "<ul><li>Information about conceal carry permit applicants (including background records and names of references) is confidential and cannot be FOIAed.</li><li>Gun licenses must go into police database. An electronic record shall be kept of pistol licenses — information should be promptly made available to the police.</li><li>Purchaser can obtain a copy of his/her info put into database, but can be charged for a copy.</li></ul>", "Kansas": "<ul><li>Information identifying concealed carry permit holders is not available to the public.</li><li>Statistical information about concealed carry permits applied for and issued is available to the public.</li></ul>", "Utah": "<ul><li>The state does not maintain a database of gun registrations or permits.</li></ul>", "Virginia": "<ul><li>In 2010, laws to record information about sales of pistols and revolvers, such as the name, type of gun and the date of the sale, were repealed and all records that had been collected previously were ordered destroyed.</li><li>Machine guns must be registered, but the registration data cannot be made public</li></ul>", "Oregon": "<ul><li>Though permits are not required to purchase a gun, owners who want to carry one with them to have to obtain a permit. Records of these permits do seem to be public record. The Reporters Committee on Freedom of the Press quotes an Oregon statute stating that \"the sheriff shall keep a record of each license issued under ORS 166.291 and this section, or renewed pursuant to ORS 166.295.\" The RCFP goes on to note that there have been court decisions in favor of public disclosure: \"Oregon’s intermediate appellate court has held that records of concealed handgun licenses are public records. Mail Tribune, Inc. v. Winters, 236 Or. App. 91, 237 P.3d 831 (2010).  The court held that exceptions for personal privacy under 192.502(2) and for security measures under 192.502(23) did not generally prohibit disclosure absent an individualized showing of privacy or security concerns.\"</li></ul>", "Connecticut": "<ul><li>Names and addresses of people with permits to sell or carry pistols or revolvers are confidential and exempt from FOIA.</li><li>Names and addresses of those with permits to own assault weapons are also confidential.</li></ul>", "Montana": "<ul><li>Montana does not require a permit to possess a gun, but the state requires concealed carry permits for urban areas, which run through each county's sheriff's office; Montana generally files an internal report annually containing the number of active concealed carry permits and the names of each permit holder, which the public can request access to at any time.</li></ul>", "California": "<ul><li>All data related to firearm ownership is confidential.</li></ul>", "Massachusetts": "<ul><li>Massachusetts public records law includes an exemption for identifying information related to firearms records. Names and addresses in applications for licenses to possess or carry firearms, as well as names and addresses in information related to friearms sales or transfers, are exempt from disclosure.</li><li>Licensing authority should keep a record of all licenses for the purposes of renewals and re-issues.</li><li>A roster of large capacity rifles, shotguns, firearms and feeding devices must be published in newspapers and sent to arms dealers.</li></ul>", "West Virginia": "<ul><li>Licenses are required for concealed weapons, but these are issued by local sheriffs offices, not by the state.<ul><li>The sheriff shall, immediately after the license is granted as aforesaid, furnish the Superintendent of the West Virginia State Police a certified copy of the approved application. The sheriff shall furnish to the Superintendent of the West Virginia State Police at any time so requested a certified list of all licenses issued in the county. The Superintendent of the West Virginia State Police shall maintain a registry of all persons who have been issued concealed weapons licenses.</li></ul></li><li>The Reporter's Committee for Freedom of the Press  says the state police are required to maintain a register of concealed carry permit holders and that the data appears to be subject to Freedom of Information Act requests: http://www.rcfp.org/west-virginia-open-government-guide/iv-record-categories-open-or-closed/k-gun-permits</li></ul>", "South Carolina": "<ul><li>Permits are required to carry handguns. The permits are a responsibility of the State Law Enforcement Division, which must maintain a list of permit holders. The list can only be released to law enforcement officials for an investigation or if the list is requested in a court order.</li></ul>", "New Hampshire": "<ul><li>All papers and records pertaining to licenses to carry pistols and revolvers are confidential and only for the use of law enforcement officials and the federal government.</li><li>State cannot keep track of the names or IDs of licensees.</li></ul>", "Vermont": "<ul><li>No permit is required for buying or carrying a gun.</li></ul>", "Delaware": "<ul><li>State cannot keep track of approved licensees or of firearm transactions. They can keep track of certain information if they have reason to believe that someone is committing a crime.</li><li>State cannot keep records of firearm licensees or of transactions.</li><li>List of employees (and their personal information) of deadly weapons dealers must be kept confidential, but can be made available to law enforcement officials.</li></ul>", "North Dakota": "<ul><li>North Dakota does not require a permit to purchase a firearm and does not require registration of firearms. North Dakota requires and issues permits to carry a concealed weapon. Information collected from permit applicants is confidential and can only be disclosed to law enforcement and court officials.</li></ul>", "Pennsylvania": "<ul><li>No government or law enforcement agency can create, maintain or operate any registry of firearm ownership.</li><li>All information provided by potential purchaser is confidential and not subject to public disclosure.</li><li>Records related to incidents in which minors have been found in possession of guns is confidential.</li><li>Rules state that the State Police can put in place regulations that ensure the confidentiality of firearm registration information.</li></ul>", "Florida": "<ul><li>There must be a database of people prohibited from purchasing firearms.</li><li>Officials cannot convert written records, compile them electronically or publish them publicly.</li><li>Data collected on people who are eligible to purchase a firearm is confidential and cannot be realeased in any way.</li></ul>", "Alaska": "<ul><li>Alaska does not require a permit for concealed carry. Anyone over the age of 21 in Alaska who can possess a firearm can carry it concealed. However, the state of Alaska does issue concealed carry permits to those who wish to carry a concealed weapon in states with which Alaska has a reciprocity agreement. The permits, application and renewals are not public record and can only be used for law enforcement purposes. Upon request, statistical information, such as the number of permits issued, can be released.</li><li>Pawn brokers and secondhand brokers must keep records of all sales, including sales of firearms. Those brokers in a municipality of more than 5,000 people must keep an electronic record. All records are to be shared with law enforcement officials.</li></ul>", "Kentucky": "<ul><li>Kentucky does not issue licenses to purchase firearms, and weapons may be carried unconcealed without a permit. State police maintain records of concealed carry permits, available only to law enforcement. Statistical reports are available online.</li></ul>", "Hawaii": "<ul><li>Gun registration data is not available to the public.</li></ul>", "Nebraska": "<ul><li>The state cannot keep records of the names of licensees or the names of potential buyers.</li></ul>", "Missouri": "<ul><li>Gun Acquisition Permits (also known as \"Handgun Permits\" and \"Concealable Weapon Permits\"), which let individuals purchase a firearm, were ordered to be made private in August 2008 with the repeal of a Missouri statute requiring such information to be public in 2007.</li><li>County sheriffs manage the issuance of concealed carry permits. They keep a record of all applications and whether or not they were accepted or denied, then report their findings to the state police. These records, and any information relating to a holder of a concealed carry permit, are not available for public release.</li></ul>", "Wisconsin": "<ul><li>Information is available to law enforcement.</li></ul>", "Alabama": "<ul><li>Information collected from an applicant for a license to carry a pistol or an approved licensee, including name, address and signature, is confidential. The information can only be used by law enforcement officials or when a licensee is charged with a felony while using a pistol.</li><li>Statistical information, including annual number of applicants, number of issued licenses, revenue from issuing licenses and other fiscal information, are publicly available. The sheriff must redact the name, address, signature and photo of a licensee before releasing a copy of the license for reasons not related to law enforcement. The sheriff can charge $1 to release a redacted copy of a license.</li><li>Releasing any confidential information related to licenses or license applications without authorization is a class A misdemeanor.</li></ul>", "Rhode Island": "<ul><li>In Rhode Island, people are not required to obtain a permit in order to purchase a firearm. However, the state requires and issues concealed carry permits. Identifying information related to applications and concealed carry permits is not public record, but the Attorney General's office can release statistical information upon request.</li><li>Records related to incidents in which students are found on school grounds with weapons are confidential and will only be shared with school officials that deal directly with the student.</li></ul>", "South Dakota": "<ul><li>Permits are required for concealed carry and are issued by the local sheriffs office. South Dakota Criminal Law prohibits state agencies, politicial subdivisions from releasing a list of permits or application information to anyone except to law enforcement officials or the secretary of state.</li></ul>", "Colorado": "<ul><li>Sheriff must keep a list of concealed carry permittees. Any database of this information can only be searchable by name, and must be shared with law enforcement.</li><li>Sheriff cannot share information about permits for a statewide database, nor can anyone else.</li><li>Local governments cannot maintain a firearms database containing any of the following:<ul><li>People who purchase, exchange, repair of firearms</li><li>People who transfer firearms, unless they are licensed dealers</li><li>Descriptions of firearms purchased</li></ul></li><li>Firearms dealers must maintain records of all sales and make them available to law enforcement officials.</li></ul>", "New Jersey": "<ul><li>There are records made of each gun permit application, including concealed carry permits, but New Jersey does not allow application or permit information regarding any firearm to be made public. Certain governmental officials can access this information.</li></ul>", "Washington": "<ul><li>There is a database of concealed pistol licenses, but it's not available to the public.</li></ul>", "North Carolina": "<ul><li>There are two types of gun permits in North Carolina; one for purchases and the other for concealed carry. The state maintains a database of concealed carry permits, and it is publicly available. Less clear is the status of the purchase permits. They may be issued by a local sheriff, in which case access to the information would have to be on a county-by-county basis at the discretion of local officials' schedules.</li></ul>", "Tennessee": "<ul><li>Tennessee Department of Safety and Homeland Security maintains a database of handgun carry permit holders.  That information is public record.</li></ul>", "District of Columbia": "<ul><li>A database of gun registrations is maintained, but it's not available to the public.</li></ul>", "Texas": "<ul><li>State requires permits for concealed carry and makes the statistical data available but not names and addresses of permit holders</li></ul>", "Nevada": "<ul><li>The name of a permit holder is public record. Public records requests for identifying information can be filled by the government, but the government entity can redact information in the records deemed confidential.</li></ul>", "Maine": "<ul><li>the issuing authority must keep a permanent record of handgun concealed carry permits isssued, and these records are open to public inspection.</li></ul>"}